Autodesk.Navisworks.Api.ProjectionResult
Represents result of projecting a point.

Autodesk.Navisworks.Api.ProjectionResult.#ctor
Constructor for a projection result.

Autodesk.Navisworks.Api.ProjectionResult.Depth
Depth value (in clip space).

Autodesk.Navisworks.Api.ProjectionResult.X
X screen co-ordinate.

Autodesk.Navisworks.Api.ProjectionResult.Y
Y screen co-ordinate.